app/controllers/categories_controller.rb

SELECT * FROM `categories`
---
  def index
    @categories = Category.all

SELECT * FROM `categories` WHERE (`categories`.`id` = 1)
---
  def edit
    @category = Category.find(params[:id])

INSERT INTO `categories` (`created_at`, `title`, `updated_at`, `description`) VALUES('2010-04-16 13:58:11', 'Beverages', '2010-04-16 13:58:11', 'This category covers beverages or drinks, which are liquids, specifically prepared for human consumption. In addition to basic needs, beverages form a part of the culture of human society.')
---
  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save