app/controllers/dishes_controller.rb

  def index
    @dishes = Dish.all
---
SELECT * FROM `dishes`

  def show
    @dish = Dish.find(params[:id])
---
SELECT * FROM `dishes` WHERE (`dishes`.`id` = 1)

  def edit
    @dish = Dish.find(params[:id])
---
SELECT * FROM `dishes` WHERE (`dishes`.`id` = 1)

  def create
    @dish = Dish.new(params[:dish])

    respond_to do |format|
      if @dish.save
---
INSERT INTO `dishes` (`created_at`, `title`, `updated_at`, `ingredients`, `instructions`) VALUES('2010-04-16 12:25:02', 'Spagetti', '2010-04-16 12:25:02', 'Spagetti\r\nSouce\r\nTomatos', 'Put spagetti to the cool water')